app/Controllers/Api/Auth.php

    public function handle()
    {
        $action = (string) $this->request->getGet('action') ?: 'check';

        if ($action === 'check') {
            if (strtoupper($this->request->getMethod()) !== 'GET') {
                return $this->response->setStatusCode(405)->setJSON(['success' => false, 'error' => 'Metodo no permitido']);
            }
        } else {
            if (strtoupper($this->request->getMethod()) !== 'POST') {
                return $this->response->setStatusCode(405)->setJSON(['success' => false, 'error' => 'Metodo no permitido']);
            }
            // CodeIgniter CSRF is automated if enabled in Filters, but we'll enforce our manual session one just in case
            app_verify_csrf();
        }

        $db = \Config\Database::connect();
        $data = $this->request->getJSON(true) ?? [];
        $session = session();

        if ($action === 'check') {
            if ($session->has('user_id')) {
                $user = $db->table('usuarios')->select('codigo_publico, es_premium, premium_vence_en')->where('id', $session->get('user_id'))->get()->getRowArray() ?: [];
---
SELECT `codigo_publico`, `es_premium`, `premium_vence_en`
FROM `usuarios`
WHERE `id` = 1