app/Controllers/Api/JikanProxy.php

SELECT *
FROM `jikan_cache`
WHERE `cache_key` = 'f2535d31b5f31ecf7810f0119264a8bf'
---
    public function handle()
    {
        $endpoint = (string) $this->request->getGet('endpoint');
        if ($endpoint === '') {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Endpoint is required']);
        }

        $db = \Config\Database::connect();
        if (!$db->tableExists('jikan_cache')) {
            // Early bypass if table does not exist somehow
            return $this->fetchFromApi($endpoint, null);
        }

        $cacheKey = md5($endpoint);
        $cached = $db->table('jikan_cache')->where('cache_key', $cacheKey)->get()->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `jikan_cache`
WHERE `cache_key` = 'f2535d31b5f31ecf7810f0119264a8bf'
UPDATE `jikan_cache` SET `endpoint` = 'anime/59978/episodes/4', `response` = '{\"data\":{\"mal_id\":4,\"url\":\"https:\\/\\/myanimelist.net\\/anime\\/59978\\/Sousou_no_Frieren_2nd_Season\\/episode\\/4\",\"title\":\"Other People\'s Homes\",\"title_japanese\":\"\\u8ab0\\u304b\\u306e\\u6545\\u90f7\",\"title_romanji\":\"Dareka no Kokyou\",\"duration\":1440,\"aired\":\"2026-02-06T00:00:00+09:00\",\"filler\":false,\"recap\":false,\"synopsis\":\"Stark only asked Fern out as a joke, but the two end up going on a date. (Source: Crunchyroll)\"}}', `updated_at` = '2026-04-10 18:36:12'
WHERE `cache_key` = 'f2535d31b5f31ecf7810f0119264a8bf'
---
    private function fetchFromApi(string $endpoint, ?array $cached = null, ?string $cacheKey = null, $db = null)
    {
        $url = 'https://api.jikan.moe/v4/' . ltrim($endpoint, '/');
        if (preg_match('/(anime|manga|top|seasons|search)/i', $url) && !str_contains($url, 'sfw=')) {
            $url .= (str_contains($url, '?') ? '&' : '?') . 'sfw=1';
        }

        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
        curl_setopt($ch, CURLOPT_USERAGENT, 'WebAnime_CI4_Replica Jikan Proxy');
        curl_setopt($ch, CURLOPT_TIMEOUT, 15);
        $response = curl_exec($ch);
        $httpCode = curl_getinfo($ch, CURLINFO_HTTP_CODE);
        curl_close($ch);

        if ($httpCode === 200 && !empty($response)) {
            $filteredResponse = $this->filterResponse((string) $response);

            if ($db && $cacheKey) {
                // Implement REPLACE INTO or Update/Insert based on existence
                $exists = $db->table('jikan_cache')->where('cache_key', $cacheKey)->countAllResults(false) > 0;
                if ($exists) {
                    $db->table('jikan_cache')->where('cache_key', $cacheKey)->update([
                        'endpoint' => $endpoint,
                        'response' => $filteredResponse,
                        'updated_at' => date('Y-m-d H:i:s')
                    ]);