app/ReplicaCi4/Controllers/Api/JikanProxy.php

    public function handle()
    {
        $endpoint = (string) $this->request->getGet('endpoint');
        if ($endpoint === '') {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Endpoint is required']);
        }

        $db = \Config\Database::connect();
        if (!$db->tableExists('jikan_cache')) {
            // Early bypass if table does not exist somehow
            return $this->fetchFromApi($endpoint, null);
        }

        $cacheKey = md5($endpoint);
        $cached = $db->table('jikan_cache')->where('cache_key', $cacheKey)->get()->getRowArray();
---
SELECT *
FROM `jikan_cache`
WHERE `cache_key` = 'f66533c26f18bc3995d7ced37325ad7d'

    private function fetchFromApi(string $endpoint, ?array $cached = null, ?string $cacheKey = null, $db = null)
    {
        $url = 'https://api.jikan.moe/v4/' . ltrim($endpoint, '/');
        if (preg_match('/(anime|manga|top|seasons|search)/i', $url) && !str_contains($url, 'sfw=')) {
            $url .= (str_contains($url, '?') ? '&' : '?') . 'sfw=1';
        }

        $ch = curl_init();
        curl_setopt($ch, CURLOPT_URL, $url);
        curl_setopt($ch, CURLOPT_RETURNTRANSFER, 1);
        curl_setopt($ch, CURLOPT_USERAGENT, 'WebAnime_CI4_Replica Jikan Proxy');
        curl_setopt($ch, CURLOPT_TIMEOUT, 15);
        $response = curl_exec($ch);
        $httpCode = curl_getinfo($ch, CURLINFO_HTTP_CODE);
        curl_close($ch);

        if ($httpCode === 200 && !empty($response)) {
            $filteredResponse = $this->filterResponse((string) $response);

            if ($db && $cacheKey) {
                // Implement REPLACE INTO or Update/Insert based on existence
                $exists = $db->table('jikan_cache')->where('cache_key', $cacheKey)->countAllResults(false) > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `jikan_cache`
WHERE `cache_key` = 'f66533c26f18bc3995d7ced37325ad7d'