app/ReplicaCi4/Controllers/Api/Profile.php

    public function handle()
    {
        $session = session();
        if (!$session->has('user_id')) {
            return $this->response->setJSON(['success' => false, 'error' => 'No session']);
        }

        $userId = $session->get('user_id');
        $db = \Config\Database::connect();
        $action = (string) $this->request->getGet('action') ?: 'get';

        if ($action === 'get') {
            if ($this->request->getMethod(true) !== 'GET') {
                return $this->response->setStatusCode(405)->setJSON(['success' => false, 'error' => 'Metodo no permitido']);
            }

            $userRow = $db->table('usuarios')->select('codigo_publico')->where('id', $userId)->get()->getRowArray() ?: [];

            $metaData = $db->table('usuarios_meta')->where('usuario_id', $userId)->get()->getResultArray();
---
SELECT `codigo_publico`
FROM `usuarios`
WHERE `id` = 1
SELECT *
FROM `usuarios_meta`
WHERE `usuario_id` = 1