app/Models/Anime.php

    public function getGeneros(int $animeId): array
    {
        $results = $this->db->table('generos g')
            ->select('g.nombre')
            ->join('anime_generos ag', 'g.id = ag.genero_id')
            ->where('ag.anime_id', $animeId)
            ->get()->getResultArray();
---
SELECT `g`.`nombre`
FROM `generos` `g`
JOIN `anime_generos` `ag` ON `g`.`id` = `ag`.`genero_id`
WHERE `ag`.`anime_id` = 2

    public function getFilteredGenres(): array
    {
        $restricted = ['Hentai', 'Erotica', 'Ecchi', 'Yaoi', 'Yuri', 'Gore', 'Harem', 'Reverse Harem', 'Rx', 'Girls Love', 'Boys Love'];
        $results = $this->db->table('generos')
            ->select('nombre')
            ->whereNotIn('nombre', $restricted)
            ->orderBy('nombre', 'ASC')
            ->get()->getResultArray();
---
SELECT `nombre`
FROM `generos`
WHERE `nombre` NOT IN ('Hentai','Erotica','Ecchi','Yaoi','Yuri','Gore','Harem','Reverse Harem','Rx','Girls Love','Boys Love')
ORDER BY `nombre` ASC